share/tutorials/incompressible/simple/mixer_vessel_2d/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  rotor
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  stator
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  front
  {
    type            empty;
  }
  back
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
