share/tutorials/incompressible/simple/mixer_vessel_2d/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1;

boundaryField
{
  rotor
  {
    type            kqRWallFunction;
    value           uniform 0;
  }
  stator
  {
    type            kqRWallFunction;
    value           uniform 0;
  }
  front
  {
    type            empty;
  }
  back
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
