share/tutorials/incompressible/simple/mixer_vessel_2d/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  rotor
  {
    type            zeroGradient;
  }
  stator
  {
    type            zeroGradient;
  }
  front
  {
    type            empty;
  }
  back
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
