share/tutorials/incompressible/simple/mixer_vessel_2d/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-08;
    relTol          0.05;
    smoother        GaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 20;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  U
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    nSweeps         2;
    tolerance       1e-07;
    relTol          0.1;
  }
  k
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    nSweeps         2;
    tolerance       1e-07;
    relTol          0.1;
  }
  epsilon
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    nSweeps         2;
    tolerance       1e-07;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}
relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    U               0.5;
    k               0.5;
    epsilon         0.5;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
